
window.addEventListener('load', function () {
    let preloader = document.querySelector('.preloader');
    window.setTimeout(() => {
        preloader.style.opacity = 0;
    }, 1000)
    window.setTimeout(() => {
        preloader.style.display = 'none';
    }, 3000)
})





let carrData = [
    {
        name: 'Острів Хортиця',
        model: '23,59 км²',
        year: 'Європа',
        color: '12,5 км',
        price: 'річка Дніпро',
        image: 'island.jpg',
        regin: 'Запорізька область, м. Запоріжжя, Вознесенівський райоn',
        about: 'Хо́ртиця — найбільший острів на Дніпрі, розташований поблизу Запоріжжя, нижче Дніпровської ГЕС. Унікальний природний та історичний комплекс. Хортиця є одним із Семи чудес України. На північному краю острова був останній дніпровський поріг.',
    },
    { name: 'Водоспад Шипіт', model: '13.78 км²', year: 'Європа', price: 'Закарпатської області', color: '13,7 км', image: 'vaterfall.jpeg', about: 'Розташований у неглибокій ущелині річки Пилипець у межах Міжгірського району Закарпатської області, приблизно за 10 км від залізничної станції Воловець, за 6 км від села Пилипець. Водоспад утворився на місці виходу стійких пісковиків палеогену й гравелітів з тонкими прошарками сланців.', regin: ' Україна, Закарпатська область, Міжгірський район, біля с. Пилипець' },
    { name: 'Дендропарк "Олександрія"', model: '19.50 км²', year: 'Європа', price: 'Київська область', color: '17,6 км²', image: 'park.jpg', about: 'Олександрі́я — державний дендрологічний парк Національної академії наук України. Розташований у північно-східній частині Правобережного лісостепу, за 80 км на південь від Києва на північно-західній околиці міста Біла Церква, на висоті 80 — 106 м над рівнем моря.', regin: 'Україна, Київська область' },
    { name: 'Гранітно-степове Побужжя', model: '31.30 км²', year: 'Європа', price: 'Актовський канйон. У межах північно-західної частини Миколаївської області', color: '19,8 км', image: 'act.jpg', about: 'Грані́тно-степове́ Побу́жжя — природний комплекс в Україні, у межах північно-західної частини Миколаївської області. Вважається однією з найдавніших ділянок суші Євразії, яка не поринала у морські глибини протягом 60 мільйонів років.', regin: 'Миколаївська область' },
    { name: 'Оптимістична печера', model: '22.54 км²', year: 'Європа', price: 'на південний захід від села Королівка', color: '11,5 км', image: 'opt.jpg', about: 'Оптимісти́чна — гіпсова печера в Тернопільській області України; геологічна памятка природи загальнодержавного значення. Розташована в межах Чортківського району, на південний захід від села Королівка, в лісовому урочищі «Королівка». Це найдовша у світі гіпсова печера, яка увійшла до Книги рекордів Гіннеса.', regin: 'Тернопільська область' },
    { name: 'Урицькі скелі', model: '46.68 км²', year: 'Європа', price: 'Тустань. Неподалік від села Урич Сколівського району Львівщини, серед лісу', color: '17,4 км', image: 'skeli.jpg', about: 'Неподалік від села Урич Сколівського району Львівщини, серед лісу, є оригінальна природна памятка – Урицькі скелі. Це місце входить до складу Національного парку «Сколівські Бескиди» та Державного історико-культурного заповідника «Тустань».', regin: 'Поблизу села Урич Сколівського' },

]

let carrApp = {
    data() {
        return {
            cars: carrData,
            currentCar: carrData[0],
            currentIndex: 0,
        }
    },
    methods: {
        showCar(index) {
            this.currentCar = carrData[index];
            this.currentIndex = index;
        }
    },
}
Vue.createApp(carrApp).mount('#vue-cont')